[CORE / GOVERNANCE]
law
authority
power
duty
responsibility
legitimacy
rule
norm
governance
validity
invalidity
applicability
scope
domain
coverage
recognition
classification
verification
validation
resolution
override
priority
hierarchy
defeasibility
ambiguity
gap
conflict
consistency
inconsistency
determinacy
indeterminacy
interpretation
construction
formalization
institution
doctrine
jurisprudence
administration
oversight
supervision
control

[AUTHORITY / VALIDITY / INSTITUTIONAL STATUS]
jurisdiction
competence
capacity
standing
justiciability
ultra_vires
mandate
authorization
designation
delegation
ratification
revocation
appointment
recognition_rule
competency
official_capacity
lawful_authority
public_authority
inherent_power
discretionary_power
ordinance_power
judicial_power
political_question
reviewability
state_capacity
institutional_competence
legal_capacity
authority_body
tribunal
court
forum
venue
vicinage
territoriality
extraterritoriality
domicile
residence
situs
personal_jurisdiction
general_jurisdiction

[POWER / FORCE / CONTROL]
coercion
compulsion
constraint
restraint
force
influence
dominance
countervailing_power
market_power
effective_control
physical_control
operational_control
state_action
command
command_responsibility
countermeasure
retaliation
deterrence
suppression
seizure
detention
search
arrest
blockade
embargo
occupation
oppression
de_facto_authority
de_jure_authority
de_facto_status
de_jure_status
usurpation
capture
expulsion
deprivation
restriction
prohibition_order
cease_and_desist
corrective_power
emergency_power
nondelegation
independence
neutrality
separation
separation_of_powers

[DUTY / OBLIGATION / CONSTRAINT]
obligation
requirement
undertaking
commitment
promise
stipulation
condition
condition_precedent
condition_subsequent
constraint_rule
pre_existing_duty
positive_duty
public_duty
legacy_duty
succession_duty
duty_of_care
duty_of_loyalty
duty_of_disclosure
duty_of_performance
duty_of_omission
duty_to_warn
duty_to_act
duty_to_refrain
mandatory_rule
bindingness
binding_effect
expectation
reliance
forbearance
waiver
exception
exemption
permission
privilege
right
entitlement
immunity
liberty
negative_liberty
positive_liberty
fundamental_right
human_right

[FAILURE / BREACH / NONCOMPLIANCE]
violation
breach
breach_of_contract
breach_of_duty
breach_of_trust
noncompliance
failure
default
nonperformance
infringement
wrongdoing
misconduct
malfeasance
misfeasance
nonfeasance
delict
offence
transgression
disobedience
dereliction
omission
harm
injury
damage
loss
impairment
deprivation_of_liberty
nuisance
trespass
conversion
fraud
deceit
misrepresentation
concealment
falsity
perjury
harassment
oppression_rule
environmental_harm
pollution
intrusion
interference
obstruction

[RESPONSIBILITY / ATTRIBUTION / LIABILITY]
liability
strict_liability
vicarious_liability
joint_liability
several_liability
concurrent_liability
civil_liability
criminal_liability
accountability
answerability
attribution
culpability
blame
fault
gross_negligence
negligence
carelessness
scienter
mens_rea
actus_reus
intent
special_intent
general_intent
knowledge
knowledge_element
awareness
recklessness
indifference
complicity
complicity_liability
aiding
abetting
instigation
conspiracy
conspiracy_liability
procurement
inducement
causation
proximate_cause
intervening_cause
concurrent_cause
attenuation
remoteness

[LAW / RULE / SOURCES]
statute
regulation
ordinance
directive
policy
code
framework
instrument
provision
clause
article
section
amendment
bill
charter
bill_of_rights
constitution
constitutionalism
custom
customary_law
case_law
precedent
stare_decisis
ratio
dictum
maxim
guideline
secondary_rule
primary_rule
conflict_rule
priority_rule
interpretive_rule
resolution_rule
registration_rule
limitation_rule
exception_rule
restriction_rule
procedural_rule
substantive_rule
rule_of_law
legality
lawfulness
illegality
normativity
legal_relation
legal_status
legal_person
legal_interest
legal_error
legal_fiction
legal_wrong
legal_personality

[PROCEDURE / ADJUDICATION]
procedure
process
adjudication
hearing
trial
judgment
verdict
finding
finding_of_fact
appeal
review
cassation
petition
complaint
filing
submission
pleading
motion
reply
rejoinder
interpleader
joinder
misjoinder
nonjoinder
intervention
interrogatory
interrogation
deposition
affidavit
attestation
evidence
proof
burden
burden_of_proof
burden_shifting
standard_of_proof
preponderance
clear_and_convincing
probable_cause
probative_value
admissibility
best_evidence
hearsay
corroboration
judicial_notice
cross_examination
leading_question
expert_testimony
witness
testimony
transcript
record
exhibit
inspection
audit

[REMEDIES / RESPONSES / OUTCOMES]
remedy
relief
equitable_relief
declaratory_relief
declaratory_judgment
injunction
preliminary_injunction
specific_performance
damages
liquidated_damages
punitive_damages
special_damages
general_damages
compensation
reparation
restitution
redress
rescission
rescissory_damages
reimbursement
indemnity
contribution
recoupment
setoff
subrogation
reformation
rectification
vacatur
remission
reprieve
pardon
amnesty
probation
sentence
punishment
penalty
sanction
execution_of_judgment
enforcement
foreclosure
garnishment
levy
attachment_order
receivership
disgorgement
redemption
equity_of_redemption

[CONTRACT / AGREEMENT / CONSENSUS]
contract
agreement
assent
mutual_assent
consideration
offer
offeror
offeree
counteroffer
acceptance
rejection
revocation_of_offer
option
option_contract
bilateral_contract
unilateral_contract
quasi_contract
novation
assignment
assignee
assignor
delegation_of_duty
ratification_clause
rescission_clause
waiver_clause
merger_clause
integration
parol_evidence
frustration
frustration_of_purpose
impracticability
impossibility
anticipatory_breach
material_breach
part_performance
perfect_tender
performance_bond
warranty
merchantability
fitness
condition_of_sale
guarantee
guarantor
surety
suretyship
letter_of_credit
escrow
escrow_agent
settlement
accord
accord_and_satisfaction
compromise
release
reservation_of_rights
nonwaiver

[PROPERTY / TITLE / POSSESSION]
property
real_property
personal_property
ownership
title
title_deed
good_title
betterment
possession
constructive_possession
adverse_possession
custody
custodian
custodianship
holding
occupancy
occupation_right
transfer
transferor
transferee
conveyance
reconveyance
alienation
encumbrance
lien
security_interest
hypothecation
pledge
pledgee
pledgor
mortgage
mortgagor
mortgagee
lease
leasehold
lessor
lessee
tenure
tenancy
joint_tenancy
servitude
easement
negative_easement
prescriptive_easement
usufruct
usufructuary
wayleave
right_of_way
appurtenance
chattel
bailment
bailee
bailor
trust
trustee
trustor
beneficiary
constructive_trust
equitable_title
estate
fee_simple
life_estate
remainder
reversion
reversionary_interest
homestead

[COMMERCE / FINANCE / ALLOCATION]
account
accounting
credit
creditor
debt
debtor
debenture
bond
bondholder
security
premium
valuation
appraisal
allocation
distribution
apportionment
taxation
rate
fund
endowment
investment
profit
loss_distribution
surplusage
windfall
unjust_enrichment
market_allocation
commodity
franchise
license
licensee
licensor
trade_secret
copyright
patent
patentee
royalty
payment
consideration_value
quantification
price
shortfall
undercharge
reimbursement_claim
collection
garnishment_claim

[CRIMINAL / PUBLIC ORDER]
crime
criminality
felony
misdemeanor
indictment
arraignment
prosecution
prosecution_witness
acquittal
conviction
double_jeopardy
self_incrimination
custodial_interrogation
detainer
detention_order
forensic_proof
imprisonment
parole
probation_order
incitement
racketeering
sedition
treason
robbery
burglary
theft
assault
battery
kidnapping
abduction
contempt_of_court
obscenity
public_order
public_safety
public_interest
public_law
policing
law_enforcement
prosecutorial_discretion
mensrea_element
strict_scrutiny
rational_basis
equal_protection
due_process
substantive_due_process
procedural_fairness

[DEFENCES / JUSTIFICATIONS / EXCUSES]
defence
defense_of_necessity
justification
excuse
self_defence
necessity
duress
mistake
mistake_of_fact
mistake_of_law
consent_defence
alibi
immunity_clause
privilege_defence
lawful_excuse
authorization_defence
lawful_authority_defence
exoneration
mitigation
attenuation_defence
provocation
insanity
insanity_defence
incapacity
intoxication
minority
coercive_duress
entrapment
clean_hands
equitable_estoppel
promissory_estoppel
waiver_by_conduct
laches
acquiescence
condonation

[EVIDENCE / PROOF / EPISTEMIC]
evidence_rule
proof_rule
admissibility_rule
presumption
presumption_of_innocence
irrebuttable_presumption
rebuttable_presumption
inference
adverse_inference
best_evidence_rule
weight_of_evidence
credibility
corroboration_rule
materiality
relevance
irrelevance
sufficiency
insufficiency
certainty
uncertainty
falsifiability
verification_rule
authentication
attestation_rule
notoriety
constructive_notice
actual_notice
notice
notice_rule
publication
disclosure
disclosure_rule
transparency
open_court
open_justice

[STATUS / PERSON / RELATION]
personhood
personality
legal_person
citizenship
residency
domicile_status
minority_status
majority_status
guardianship
guardianship_order
family_relation
kinship
marriage
divorce
child_custody
filiation
parentage
successor
heir
inheritance
bequest
legatee
testator
testament
will
intestacy
testacy
succession
succession_rule
residuary_estate
estate_administration
executor
administrator
ancestor
lineage
patrimony
dowry
consortium
cohabitation
emancipation
ward
guardian

[LABOR / ORGANIZATIONAL / ASSOCIATIONAL]
employer_liability
employment
termination
suspension
discipline
collective_right
collective_action
industrial_action
boycott
union
association
corporation
company
committee
board
director
officer
agent
principal
agency
agency_power
apparent_authority
implied_authority
express_authority
fiduciary_duty
duty_of_loyalty
conflict_of_interest
self_dealing
corporate_opportunity
shareholder
stockholder
partnership
general_partner
limited_partner
joint_enterprise
governor
regulator
ombudsman
public_office

[CONSTITUTIONAL / POLITICAL]
sovereignty
constitutional_order
federalism
separation_of_powers
judicial_review
free_exercise
free_speech
symbolic_speech
assembly
petition_right
voting
suffrage
representation
constituency
elector
election
election_of_remedies
public_reason
political_authority
legislator
executive
judiciary
statehood
internationality
treaty
multilateral_treaty
jus_cogens
humanitarian_intervention
sanctuary
citizen
subject
foreign_power
public_mandate
legislative_power
executive_power

[META / STRESS / EDGE TERMS]
nullity
voidness
voidability
finality
ripeness
mootness
justiciability_bar
abstraction
specificity
threshold
trigger
timeliness
limitation_period
time_bar
tolling
expiration
duration
continuity
continuance
sequence
nexus
dependency
equivalence
correlation
causal_chain
break_in_chain
bridge_rule
exceptionality
supervening_event
contingency
potentiality
feasibility
operability
implementation
externality
vulnerability
hardship
burdensomeness
reasonableness
proportionality
abandonment
abatement
abduction
abeyance
abjuration
abnegation
abrogation
abstention
abstraction
abuse
abuse_of_process
accessory
accident
accommodation
accord
accord_and_satisfaction
account
accounting
accretion
accrual
accusation
acquiescence
acquittal
act
action
ademption
adherence
adjudicator
adjunction
administration
administrator
admissibility
admonition
adoption
adverse_inference
adverse_possession
advisory_opinion
affidavit
affirmance
affirmation
agency
agent
aggravation
aggregation
aggrievement
aid
aider
alienation
allegation
allocation
allotment
alteration
amercement
amicus
amnesty
amortization
ancestor
animus
annexation
annulment
antecedent
anticipation
antitrust
apology
appearance
appellant
appellate_review
appertainment
appraisal
apprehension
appropriator
appropriative_right
apportionment
appurtenance
arbitrability
arbitrator
arraignment
arrears
artifice
ascertainment
assault
assent
asset
assignee
assignor
assistance
association
assurance
attachment_order
attestation
attornment
attribution
auction
audience
augmentation
author
authorship
autonomy_right
avoidability
awardee
bad_title
bailor
bailee
balance
bankruptcy
barrier
base_title
battery
beacon
bequest
best_evidence
betterment
bias_rule
bid
bilateral_contract
bill
bill_of_rights
bindingness
blackmail
blamelessness
blockade
bond
bondholder
boundary
boycott
breach_of_duty
breach_of_trust
brief
broker
burden_shifting
burglary
bylaw
capacity_to_contract
capital_offense
capture
carelessness
carriage
carrier
case
case_law
cassation
caveat
cease_and_desist
cession
challenge_right
chamber
change_of_venue
chargeback
charter
charterparty
chattel
check
child_custody
choice_of_law
circumstance
citation
citizenship
civil_liability
civil_right
classification_rule
clean_hands
clear_and_convincing
clerk
closure
coercive_power
cohabitation
collateral_attack
collation
collective_right
collusion
command_responsibility
commencement
commendation
commercial_reasonableness
commingling
commission
committee
commodity
commutation
comparative_fault
compensation_order
competency
complainant
complexity
complicity_liability
composition
compound
compromise_verdict
compulsory_process
concealment_rule
concession_right
conclusiveness
concurrent_cause
concurrent_jurisdiction
condemnation
condition_precedent
condition_subsequent
conditionality
condonation
conferral_of_power
confession
confidence
confidentiality
conflict_of_laws
conflict_rule
confiscatory_taking
conflict_preemption
conflict_resolution
conformity
confrontation
connivance
conscience
consensus
consignment
consortium
conspiracy_liability
constitutionalism
constraint_rule
constructive_knowledge
constructive_possession
constructive_service
consumer_protection
contempt_of_court
contention
contestation
contingent_fee
continuance
continuity
contra_proferentem
contraband
contradiction
contribution_claim
control_test
conversion_right
convoy
copyright
corpus
correction_order
correlation
corroboration
countermeasure_rule
counteroffer
counterpart
countervailing_power
coverage_rule
credit
creditor
criminal_intent
criminality
cross_appeal
cross_claim
cross_examination
culpable_mental_state
curation
curator
curfew
custodian
custodianship
custom
customary_law
damage_award
damage_rule
dangerousness
de_facto_authority
de_jure_authority
de_legibus
de_novo_review
deactivation
deadlock
dealings
debarment
debenture
debt
debtor
deceit
decentralization
decision
declaration_of_rights
declarant
declaratory_relief
decree
decriminalization
dedication
deduction
deed
default_judgment
defamation
defeasance
defence_of_necessity
deference
deficiency
definition
delay
delict
delimitation
delinquency
delivery_rule
demand
demarcation
demurrer
denial
denunciation
dependence
deponent
deportation
deposition
deprivation_of_liberty
dereliction
derivation
descent
designation_of_authority
desuetude
detainer
determinacy
deterrence
detriment
devolution
diagnosis
dictum
difference
dignity
diligence_rule
diminution
direct_effect
directed_verdict
directive_principle
disability_right
disaffirmance
disallowance
disbarment
discharge_in_bankruptcy
disclosure_rule
discontinuance
discovery
discretionary_power
discrimination
dishonor
dismissal_with_prejudice
disobedience_rule
disorder
disparagement
dispensation
disqualification_rule
dissatisfaction
dissent
dissipation
distress
distribution_rule
divestment
divorce
document
documentation
domicile
donation
double_jeopardy
dowry
draft
drawee
drawer
duality
due_care
due_process
duration
election
election_of_remedies
elector
eligibility_rule
emancipation
embezzlement
embargo
emergency_power
eminent_domain
employer_liability
encroachment
endorsement
endowment
enjoyment
enlistment
entrapment
entry
enumeration
environmental_harm
equal_protection
equitable_estoppel
equitable_maxim
equitable_title
equity_of_redemption
error_correction
escheat
escrow_agent
estate
estimation
ethics
eviction
evidentiary_burden
evidentiary_rule
ex_parte
ex_officio
exaction
examination
exception_rule
exchange
exclusionary_rule
exclusivity
excursion
execution_of_judgment
executor
exemption_clause
exhaustion_of_remedies
exhibit
existence
expansion
expectancy
expediency
expert_testimony
expiration
express_authority
expression
expulsion_order
extenuation
externality
extinction
extradition
extraterritoriality
fabrication
facilitator
fair_comment
fair_dealing
fair_notice
fair_trial
falsity
family_resemblance
feasibility
fee_simple
felony
fiduciary
filiation
final_judgment
finder
finding_of_fact
first_possession
fitness
fixity
forbearance_agreement
forcible_entry
foreclosure
forensic_proof
forfeiture_clause
form
formalism
formation
franchise
franking
fraudulent_conveyance
free_exercise
freehold
freight
frivolousness
frustration_of_purpose
full_faith_and_credit
fund
fundamental_right
furtherance
gain
garnishment
general_damages
general_intent
general_jurisdiction
general_partner
general_principle
gift
gift_over
good_title
goodwill
governing_law
governor
grace
grading
grantor
grantee
gratification
gratuitous_promise
gravity
gross_negligence
ground
guarantor
guarantee
guardianship_order
guideline
habitability
harassment
hardship
hearsay
heirs
holding_over
homestead
hostility
human_right
hypothecation
identity
ignorance
illegality
immediacy
immunity_clause
impanelment
impartiality
impeachment
implementation
implied_authority
implied_term
importunity
imposition_rule
impracticability
imprecision
impropriety
imputation
in_camera
incapacitation
inchoate_offense
incidence
incident
inclusion
incompatibility
incorporation
incumbrance
independence_of_judiciary
indictable_offense
indispensable_party
indorsement
inducement
indulgence
industrial_action
inequality
infancy
informed_consent
inherent_power
inhibition
initial_burden
injurious_falsehood
innominate_term
insanity_defence
inspection_right
instalment
instigation
instrumentality
insufficiency
insurable_interest
insurer
integration
integrity
intentionality
interception
interdict
interest_of_justice
interim_order
interlocutory_appeal
intermeddling
internationality
interpleader
interpretive_rule
interrogation
interrogatory
intervention
intestacy
intoxication
investment
ipso_facto
irrebuttable_presumption
irrevocability
issuance
issuer
jeopardy
joinder_of_issue
joint_and_several
joint_enterprise
joint_tenancy
judge
judicial_notice
judicial_power
judicial_review
jurat
jury
jury_instruction
jury_nullification
jus_cogens
justice
justification_defence
keeper
keyman
kinship
knowledge_element
labor_right
lacuna
landlord
lapse
latent_ambiguity
latent_defect
lawful_authority
lawfulness
leading_question
leasehold
legacy_duty
legal_capacity
legal_error
legal_fiction
legal_interest
legal_person
legal_relation
legal_status
legal_wrong
legatee
legatee_right
legislator
lenity
lessee
lessor
letter_of_credit
levy
libel
liberty
licensee
licensor
lifetime_estate
limitation_period
limiting_construction
lineage
liquidated_damages
liquidation
litigant
litigation
locus_standi
maintenance
maladministration
malfeasance
malice
malpractice
manifestation
market_power
marriage
marshal
master
material_breach
material_fact
material_witness
matrimonial_property
maturity
maxim
measure_of_damages
memorandum
mensrea_element
merchantability
mercy
merger_clause
merits
minority
misappropriation
miscarriage_of_justice
misfeasance
misjoinder
misprision
misstatement
mistake_of_fact
mistake_of_law
mitigating_factor
moderation
modification_clause
monition
monopoly_power
moral_hazard
mortgage
mortgagor
mortgagee
motion
motive
multilateral_treaty
municipal_law
mutual_assent
mutuality
narrowing_construction
natural_justice
negative_easement
negative_liberty
negation
neglect
negotiability
negotiation
neighbor_principle
nexus
nolle_prosequi
nominee
nondelegation
nonfeasance
nonjoinder
nonsuit
nonwaiver
norm
normativity
notice_rule
novation_clause
nuisance_rule
nullification
oath
obedience_rule
obiter
object
obscenity
occupation_right
offer
offeree
offeror
official_capacity
omnibus_clause
onerousness
open_court
opening_statement
operability
operational_control
opinion
oppression_rule
option
option_contract
oral_argument
ordinance_power
ordinary_care
outcome_determinative
ouster
overbreadth
overreach
ownership_title
pact
pardon
parens_patriae
parity_rule
parol_evidence
part_performance
participant
partition
partnership
party
party_autonomy
patent
patentee
paternalism
patrimony
payment
peaceable_possession
penal_code
penological_interest
per_capita
per_stirpes
perfect_tender
performance_bond
permissive_use
perpetuity
persecution
personal_jurisdiction
personal_property
personality
persuasion
petitioner
physical_control
picketing
pledgee
pledgor
plea
pleading
plurality
policing
political_question
pollution
portability
positive_duty
positive_liberty
possession_order
posture
power_of_attorney
pre_existing_duty
preclusion_rule
predisposition
preliminary_injunction
premeditation
premium
preponderance
prerogative
prescriptive_easement
presentment
preservation
presumption_of_innocence
prima_facie
primary_rule
principal
priority_rule
privacy
private_defence
private_law
privation
privity
probable_cause
probative_value
probity
procedural_fairness
procedural_rule
process
procurement
production
prohibition_order
promissory_estoppel
promoter
proof
proper_purpose
proprietary_interest
proprietor
propriety
prosecution_witness
protective_order
protestation
public_authority
public_duty
public_interest
public_law
public_order
publication
punitive_damages
purchase
purchaser
purposive_interpretation
qualification_rule
quantification
quasi_contract
quorum
racketeering
rate
ratable_distribution
rational_basis
ratification_clause
ratio
ratum
real_property
reallocation
reason
receipt
receiver
reclassification
reconciliation
reconveyance
record
recusal
redemption
reentry
reference
reformation
regard
registration_rule
regress
rehabilitation_order
reimbursement_claim
reintegration
relation_back
release
reliance
relinquishment
remainder
remission
remoteness
renewal
renunciation
replevin
reply
representation_rule
reprieve
reproach
rescissory_damages
reservation_of_rights
residence
residuary_estate
resignation
resolution_rule
restraint
restriction_rule
retraction
retrospectivity
reversion
reversionary_interest
reviewability
right_of_way
ripeness
robbery
role
rule_of_law
ruling
safeguard
sale
salvage
satisfaction
savings_clause
scienter
scope_of_authority
seal
security_interest
sedition
self_help
self_incrimination
seniority
separability
sequence
service
settlor
severability
shelter_rule
shield
shipment
shortfall
situs
slander
solicitation
solvency
special_damages
special_intent
specificity
specification
standing_order
state_action
state_capacity
statement
stigma
stipendiary
stockholder
strict_scrutiny
sublease
submission
subpoena
subrogated_interest
subsequent_remedial_measure
substance
substantive_due_process
substantive_rule
subterfuge
succession_duty
suffrage
suit
superior_title
supervening_event
suppression
surety
surplusage
survivorship
suspicion
symbolic_speech
takings
taxation
tenant
tender
tenancy
territoriality
testacy
testator
testimony
theft
third_party_beneficiary
time_bar
time_of_essence
timeliness
title_deed
toller
tolling
tortfeasor
trade_secret
tradition
transaction
transcript
transferor
transferee
transparency
treaty
trespass
trigger
trustee
trustor
ulterior_motive
undercharge
undertaker
underwriting
undue_delay
uniformity
unilateral_contract
unlawfulness
unreasonableness
usage
use_right
usufructuary
usury
vacatur
vacuum
vagueness
valuation
value
variance_rule
vendor
venue
vesting
veto
vicinage
victim
vindication
voidability
volition
voluntariness
voucher
vulnerability
waste
wayleave
weight_of_evidence
will
windfall
withdrawal
withholding
witness
writ
yield
parity
equality
inequality
ab initio
abeyant_interest
abide
abiding_interest
absolutism
abstention_doctrine
abuse_of_right
acceptance_rule
access_right
accessory_after_the_fact
accessory_before_the_fact
accidental_harm
accommodation_party
account_stated
accrued_right
accumulation
accusatory_instrument
acquisition
acquisitive_prescription
act_of_state
actuarial_risk
adequacy
adequate_remedy
adhesion_contract
adjacent_owner
adjoining_land
administrative_action
administrative_discretion
administrative_law
administrative_order
administrative_rulemaking
admissible_evidence
adoptive_admission
adverse_claim
adverse_interest
adverse_witness
advisory_jurisdiction
aesthetic_regulation
affirmative_defence
affirmative_duty
affirmative_obligation
affirmative_relief
agency_cost
agency_relationship
agent_authority
agent_liability
aggravating_factor
aggregate_harm
aggregation_rule
aggrieved_party
aid_and_abet
air_rights
alleged_violation
allocation_rule
allodial_title
alternative_dispute_resolution
amicable_settlement
ancillary_jurisdiction
ancillary_proceeding
annuity
anticipatory_repudiation
anti_competitive
anti_corruption
anti_dumping
anti_trust_violation
apex_doctrine
appealable_order
appellate_brief
appellate_jurisdiction
appellate_standard
applicable_law
applicant
applicant_right
appraisal_clause
appraiser
appreciation
apprehended_bias
appropriation_of_property
appropriation_right
arbitrary_action
arbitrary_detention
arbitrary_power
arbitration_agreement
arbitration_award
arbitration_clause
arbitration_panel
arbitration_procedure
arbitral_tribunal
archival_record
armed_conflict
arraignment_procedure
arrangement
arrearage
artificial_person
asset_freeze
asset_tracing
assignment_clause
associational_right
assumption_of_risk
asymmetric_information
at_issue
attached_property
attaching_creditor
attornment_rule
attributable_conduct
attributable_state
attribution_rule
auction_sale
audit_trail
authoritative_interpretation
authoritative_source
autonomous_system
availability_rule
avoidable_consequence
bad_character
bad_debt
bad_faith_claim
bad_title_transfer
balance_of_probabilities
balancing_test
banking_regulation
bar_to_action
bargaining_power
bargaining_range
base_period
basic_structure
beneficial_interest
beneficial_owner
beneficial_title
best_interest
best_interest_of_child
binding_arbitration
binding_precedent
binding_rule
black_letter_law
blanket_rule
blocking_statute
board_resolution
bona_fide
bona_fide_purchaser
bona_vacantia
bonus_issue
borrower
breach_of_confidence
breach_of_statute
breach_of_warranty
brief_of_evidence
brokerage
burden_of_persuasion
burden_of_production
business_judgment_rule
buyer
bylaw_rule
call_option
capital_gain
capital_loss
capitalization
carve_out
case_management
case_theory
cash_flow
causal_link
causal_nexus
cause_in_fact
cause_requirement
certification
certified_copy
chain_of_title
challenge_procedure
change_in_circumstances
change_of_control
charge_sheet
charitable_trust
charity_law
chief_executive
child_support
choice_of_forum
circuit
circumstantial_evidence
citizenship_status
civil_procedure
civil_wrong
claimant
claimant_right
class_action
class_certification
clear_title
client
closed_class
closure_rule
coercive_measure
coercive_state
collateral_consequence
collateral_estoppel
collateral_security
collective_bargaining
collective_liability
collusive_action
commercial_contract
commercial_law
commercial_reasonableness_standard
commission_agent
committee_decision
common_carrier
common_enterprise
common_law
common_property
community_property
comparative_negligence
compensatory_damages
competent_authority
competitive_advantage
complaint_procedure
compliance_program
compulsory_acquisition
compulsory_license
concealment_rule
conditional_offer
conditional_transfer
conferral_rule
confidential_information
confidentiality_agreement
conflict_of_duty
conflict_of_rules
conflict_resolution_rule
conflicting_interest
conflicting_rights
confiscation_order
conformity_rule
conformity_with_law
confrontation_right
consequential_damages
consequential_loss
consideration_rule
constitutional_right
constitutional_violation
constructive_dismissal
constructive_easement
constructive_knowledge_rule
constructive_possession_rule
constructive_service_rule
consumer_right
consumer_rights_law
consumer_transaction
contested_case
contested_issue
contested_right
contingent_liability
continuing_breach
continuing_duty
continuing_offense
contract_clause
contract_interpretation
contractual_duty
contractual_right
contravention
contribution_rule
control_group
control_right
control_structure
conversion_rule
conviction_record
conviction_rate
cooperative
corporate_governance
corporate_law
corporate_personality
corporate_veil
corpus_delicti
correctional_facility
cost_allocation
cost_benefit
cost_shifting
countermeasure_rule
counterparty
countervailing_measure
court_order
court_procedure
court_record
court_rule
court_system
covenant
covenant_not_to_compete
covenant_of_good_faith
credit_agreement
credit_risk
creditworthiness
criminal_liability_rule
criminal_procedure
criminal_responsibility
critical_stage
cross_border
cross_claim_rule
cross_examination_rule
culpable_conduct
cumulative_evidence
custodial_sentence
customary_practice
damage_assessment
damage_measure
damage_rule_application
dangerous_activity
data_protection
data_subject
day_in_court
de_facto_control
de_facto_possession
de_jure_control
de_jure_possession
dead_hand_control
deadlock_resolution
deal_structure
debarment_rule
debt_collection
debt_instrument
debt_restructuring
decision_rule
decision_theory
declaratory_action
declaratory_relief_rule
declaratory_right
declared_policy
decriminalization_rule
dedicated_use
defamation_law
default_interest
default_rule
defective_title
defence_counsel
defence_right
defendant
defendant_right
defensive_measure
deficiency_judgment
definitive_agreement
delegated_authority
delegated_legislation
delegation_rule
deliberative_process
deliberative_privilege
delinquent_account
delivery_rule_application
demand_letter
demarcation_rule
democratic_legitimacy
denial_of_justice
dependent_right
deposition_rule
deprivation_rule
derivative_action
derivative_right
derogation_rule
designated_authority
designated_official
detained_person
detention_rule
determinative_factor
determinative_issue
determinative_rule
deterrent_effect
detrimental_reliance
development_right
diagnostic_rule
dicta
difference_rule
diligence_standard
diminished_capacity
direct_causation
direct_control
direct_damage
direct_effect_rule
direct_liability
direct_loss
direct_right
direct_transfer
directed_verdict_rule
direction
directive_principle_rule
disability_rule
disaffirmance_rule
disallowance_rule
discharge_rule
disclosure_obligation
disclosure_rule_application
discontinuance_rule
discovery_rule
discretion_rule
discretionary_decision
discretionary_judgment
discrimination_law
dishonor_rule
dismissal_rule
disobedience_rule_application
disorderly_conduct
disparagement_rule
dispensation_rule
disposition_rule
dispute_resolution
disputed_claim
dissolution_rule
distinction_rule
distribution_rule_application
diversion_rule
doctrine_application
documentary_evidence
domestic_law
domestic_relation
dominion
donative_intent
double_counting
double_recovery
due_care_standard
due_diligence
due_process_rule
duress_rule
duty_of_confidentiality
duty_of_fairness
duty_of_good_faith
duty_of_loyalty_rule
duty_of_performance_rule
duty_of_reasonableness
easement_appurtenant
easement_in_gross
economic_duress
economic_harm
economic_interest
economic_loss
economic_power
economic_right
effective_date
effective_remedy
effective_right
effectiveness
efficiency
election_rule
elective_share
eligibility_rule_application
emergency_rule
employer
employment_contract
employment_law
employment_right
enabling_rule
encroachment_rule
endorsement_rule
enforceable_right
enforceable_rule
enforcement_action
enforcement_power
enforcement_rule
engagement
enjoyment_right
enrolled_bill
enterprise_liability
entitlement_rule
equitable_distribution
equitable_estoppel_rule
equitable_interest
equitable_jurisdiction
equitable_remedy_rule
equitable_title_rule
equity_rule
error_rule
established_fact
established_right
established_rule
estoppel_rule
evidence_admissibility
evidence_rule_application
ex_ante
ex_post
exaction_rule
exception_rule_application
excessive_force
excessive_penalty
exchange_rule
exclusive_right
execution_rule
executor_duty
exemption_rule_application
exercise_of_power
exhaustion_rule
exhibit_rule
existing_right
expectation_damage
expectation_interest
expert_opinion
expiration_rule
express_authority_rule
express_term
expropriation_rule
extension_rule
external_harm
externality_rule
extinguishment
extrinsic_evidence
fair_comment_rule
fair_compensation
fair_dealing_rule
fair_hearing
fair_procedure
fair_trial_rule
false_imprisonment
false_statement
family_law
fiduciary_obligation
fiduciary_relationship
fiduciary_standard
final_decision
final_order
financial_interest
financial_regulation
finding_rule
first_sale
fitness_for_purpose
fixed_term
forbearance_rule
force_majeure
foreseeability
formal_requirement
formal_rule
formation_rule
fraudulent_misrepresentation
free_trade
freedom_of_contract
freedom_of_expression
freedom_of_movement
functional_equivalence
fundamental_principle
furtherance_rule
garnishment_rule
general_principle_rule
general_rule
genuine_issue
good_faith_rule
governing_document
governing_rule
grant_rule
ground_rule
guarantee_rule
habitability_rule
harm_rule
hearing_rule
holding_rule
honest_belief
horizontal_effect
hostile_environment
human_dignity
hypothetical_scenario
identity_rule
illicit_conduct
immediate_harm
immediate_risk
immunity_rule
impartial_tribunal
implementation_rule
implied_authority_rule
implied_term_rule
imposition_rule_application
improper_conduct
improper_influence
improper_purpose
improper_use
impropriety_rule
imputed_knowledge
in_camera_rule
incidental_damage
incidental_loss
inchoate_liability
inconsistent_rule
independent_contract
independent_rule
indirect_damage
indirect_loss
indirect_rule
indirect_transfer
indispensable_party_rule
individual_right
inducement_rule
inequitable_conduct
inequality_rule
inference_rule
infringement_rule
inherent_authority
initial_offer
initial_right
injurious_act
injurious_conduct
innocent_misrepresentation
insufficient_evidence
integrity_rule
intended_effect
intent_rule
interference_rule
interim_relief
internal_rule
international_law
interplay
interpretation_rule_application
interrogation_rule
intervention_rule
intestacy_rule
invalid_rule
investigative_power
investigative_rule
irregularity_rule
irreparable_harm
irrevocable_offer
issuance_rule
issue_preclusion
joint_enterprise_rule
judicial_discretion
judicial_error
judicial_function
judicial_power_rule
judicial_process
judicial_standard
judicial_system
jurisdiction_rule
jury_decision
jury_rule
justice_rule
justification_rule
knowledge_rule
law_application
law_enforcement_rule
lawful_conduct
lawful_possession
lawful_use
legal_authority
legal_claim
legal_duty
legal_entitlement
legal_interest_rule
legal_obligation
legal_principle
legal_process
legal_protection
legal_remedy
legal_requirement
legal_rule_application
legal_status_rule
legal_system
legal_validity
legislative_intent
legislative_power_rule
legitimate_expectation
legitimate_interest
legitimate_purpose
legitimate_use
legitimacy_rule
liability_rule
licensing_rule
limitation_rule_application
limited_liability
limited_right
liquidated_sum
litigation_cost
litigation_strategy
litigation_rule
locus_rule
loss_rule
maintenance_rule
malpractice_rule
manifest_intent
market_regulation
material_fact_rule
materiality_rule
measure_rule
mechanism
mediation_rule
mental_state
merger_rule
method
misapplication
misconduct_rule
misinterpretation
mistake_rule
mitigation_rule
moderation_rule
modification_rule
moral_standard
motive_rule
multiple_causation
mutual_benefit
mutual_obligation
mutual_right
narrow_construction
natural_right
necessary_condition
necessity_rule
negligence_rule
neutral_rule
non_compliance_rule
non_exclusive_right
non_performance_rule
nonbinding_rule
nonfeasance_rule
nonwaiver_rule
norm_application
normative_effect
normative_rule
normative_structure
notice_rule_application
nullification_rule
objective_standard
obligation_rule
observation
offence_rule
official_act
official_duty
official_power
official_rule
omission_rule
open_justice_rule
operational_rule
opinion_rule
opportunity
opportunity_rule
order_rule
organizational_rule
ownership_rule
panel_decision
parallel_liability
parameter
partial_performance
participant_rule
party_rule
passive_duty
penalty_rule
performance_rule
permissive_rule
personal_duty
personal_right
persuasive_authority
policy_rule
positive_rule
possession_rule
power_rule
precedent_rule
preclusion_rule_application
precondition
predictability
preemption_rule
prejudice_rule
preliminary_rule
preliminary_stage
preliminary_test
premise
preponderance_rule
prescriptive_rule
present_interest
presumption_rule
preventive_measure
primary_rule_application
principal_rule
priority_application
private_interest
private_law_rule
private_right
probability
probability_rule
probative_rule
procedural_rule_application
process_rule
prohibition_rule
promissory_rule
proof_rule_application
property_rule
proportionality_rule
prosecution_rule
protective_measure
public_interest_rule
public_law_rule_application
public_right
publication_rule
punishment_rule
qualification_rule_application
quantum
quasi_right
question_of_fact
question_of_law
ratio_rule
rational_rule
reallocation_rule
reason_rule
reasonableness_rule
rebuttal_rule
recognition_rule_application
recovery_rule
reduction
reference_rule
regulatory_power
regulatory_rule
rejection_rule
relation_rule
reliance_rule
remedial_rule
remedy_rule_application
remoteness_rule
renewal_rule
representation_rule_application
requirement_rule
rescission_rule
reservation_rule
residual_right
resolution_rule_application
responsibility_rule
restriction_rule_application
result_rule
retrospective_rule
review_rule
right_rule
risk_rule
rule_application
rule_conflict
rule_structure
sanction_rule
scope_rule
security_rule
self_defence_rule
separation_rule
service_rule
settlement_rule
standard_rule
state_power
state_rule
statutory_rule
structural_rule
subordinate_rule
subrogation_rule
substantive_rule_application
sufficiency_rule
supervision_rule
supplementary_rule
supporting_rule
system_rule
test_rule
threshold_rule
time_rule
title_rule
tort_rule
transaction_rule
transfer_rule
trust_rule
ultra_vires_rule
underlying_rule
unfair_practice
uniform_rule
unjust_rule
unlawful_act
unlawful_conduct
unlawful_use
valid_rule
validation_rule
value_rule
variance_rule_application
verification_rule_application
vested_interest
vicarious_rule
violation_rule
waiver_rule
warranty_rule
wrongful_act
wrongful_conduct
wrongful_use
